SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_mpahbram.h
/**************************************************************************//**
 * @file
 * @brief EFM32PG28 MPAHBRAM register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFM32PG28_MPAHBRAM_H
#define EFM32PG28_MPAHBRAM_H

#define MPAHBRAM_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFM32PG28_MPAHBRAM MPAHBRAM
 * @{
 * @brief EFM32PG28 MPAHBRAM Register Declaration.
 *****************************************************************************/

/** MPAHBRAM Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IP version ID                                      */
  __IOM uint32_t             CMD;                    /**< Command register                                   */
  __IOM uint32_t             CTRL;                   /**< Control register                                   */
  __IM  uint32_t             ECCERRADDR0;            /**< ECC Error Address 0                                */
  __IM  uint32_t             ECCERRADDR1;            /**< ECC Error Address 1                                */
  __IM  uint32_t             ECCERRADDR2;            /**< ECC Error Address 2                                */
  __IM  uint32_t             ECCERRADDR3;            /**< ECC Error Address 3                                */
  __IM  uint32_t             ECCMERRIND;             /**< Multiple ECC error indication                      */
  __IOM uint32_t             IF;                     /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable                                   */
  __IOM uint32_t             RAMBANKSVALID;          /**< New Register                                       */
  __IOM uint32_t             CFGSRTOP;               /**< Sequential Region on Top                           */
  __IOM uint32_t             CFGSRMAP;               /**< Sequential Region Map                              */
  __IOM uint32_t             CFGIU0MAP;              /**< Interleaving Unit 0 Map                            */
  __IOM uint32_t             CFGIU1MAP;              /**< Interleaving Unit 1 Map                            */
  __IOM uint32_t             CFGIU2MAP;              /**< Interleaving Unit 2 Map                            */
  __IOM uint32_t             CFGIU3MAP;              /**< Interleaving Unit 3 Map                            */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED1[1006U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IP version ID                                      */
  __IOM uint32_t             CMD_SET;                /**< Command register                                   */
  __IOM uint32_t             CTRL_SET;               /**< Control register                                   */
  __IM  uint32_t             ECCERRADDR0_SET;        /**< ECC Error Address 0                                */
  __IM  uint32_t             ECCERRADDR1_SET;        /**< ECC Error Address 1                                */
  __IM  uint32_t             ECCERRADDR2_SET;        /**< ECC Error Address 2                                */
  __IM  uint32_t             ECCERRADDR3_SET;        /**< ECC Error Address 3                                */
  __IM  uint32_t             ECCMERRIND_SET;         /**< Multiple ECC error indication                      */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable                                   */
  __IOM uint32_t             RAMBANKSVALID_SET;      /**< New Register                                       */
  __IOM uint32_t             CFGSRTOP_SET;           /**< Sequential Region on Top                           */
  __IOM uint32_t             CFGSRMAP_SET;           /**< Sequential Region Map                              */
  __IOM uint32_t             CFGIU0MAP_SET;          /**< Interleaving Unit 0 Map                            */
  __IOM uint32_t             CFGIU1MAP_SET;          /**< Interleaving Unit 1 Map                            */
  __IOM uint32_t             CFGIU2MAP_SET;          /**< Interleaving Unit 2 Map                            */
  __IOM uint32_t             CFGIU3MAP_SET;          /**< Interleaving Unit 3 Map                            */
        uint32_t             RESERVED2[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED3[1006U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IP version ID                                      */
  __IOM uint32_t             CMD_CLR;                /**< Command register                                   */
  __IOM uint32_t             CTRL_CLR;               /**< Control register                                   */
  __IM  uint32_t             ECCERRADDR0_CLR;        /**< ECC Error Address 0                                */
  __IM  uint32_t             ECCERRADDR1_CLR;        /**< ECC Error Address 1                                */
  __IM  uint32_t             ECCERRADDR2_CLR;        /**< ECC Error Address 2                                */
  __IM  uint32_t             ECCERRADDR3_CLR;        /**< ECC Error Address 3                                */
  __IM  uint32_t             ECCMERRIND_CLR;         /**< Multiple ECC error indication                      */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable                                   */
  __IOM uint32_t             RAMBANKSVALID_CLR;      /**< New Register                                       */
  __IOM uint32_t             CFGSRTOP_CLR;           /**< Sequential Region on Top                           */
  __IOM uint32_t             CFGSRMAP_CLR;           /**< Sequential Region Map                              */
  __IOM uint32_t             CFGIU0MAP_CLR;          /**< Interleaving Unit 0 Map                            */
  __IOM uint32_t             CFGIU1MAP_CLR;          /**< Interleaving Unit 1 Map                            */
  __IOM uint32_t             CFGIU2MAP_CLR;          /**< Interleaving Unit 2 Map                            */
  __IOM uint32_t             CFGIU3MAP_CLR;          /**< Interleaving Unit 3 Map                            */
        uint32_t             RESERVED4[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED5[1006U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IP version ID                                      */
  __IOM uint32_t             CMD_TGL;                /**< Command register                                   */
  __IOM uint32_t             CTRL_TGL;               /**< Control register                                   */
  __IM  uint32_t             ECCERRADDR0_TGL;        /**< ECC Error Address 0                                */
  __IM  uint32_t             ECCERRADDR1_TGL;        /**< ECC Error Address 1                                */
  __IM  uint32_t             ECCERRADDR2_TGL;        /**< ECC Error Address 2                                */
  __IM  uint32_t             ECCERRADDR3_TGL;        /**< ECC Error Address 3                                */
  __IM  uint32_t             ECCMERRIND_TGL;         /**< Multiple ECC error indication                      */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable                                   */
  __IOM uint32_t             RAMBANKSVALID_TGL;      /**< New Register                                       */
  __IOM uint32_t             CFGSRTOP_TGL;           /**< Sequential Region on Top                           */
  __IOM uint32_t             CFGSRMAP_TGL;           /**< Sequential Region Map                              */
  __IOM uint32_t             CFGIU0MAP_TGL;          /**< Interleaving Unit 0 Map                            */
  __IOM uint32_t             CFGIU1MAP_TGL;          /**< Interleaving Unit 1 Map                            */
  __IOM uint32_t             CFGIU2MAP_TGL;          /**< Interleaving Unit 2 Map                            */
  __IOM uint32_t             CFGIU3MAP_TGL;          /**< Interleaving Unit 3 Map                            */
        uint32_t             RESERVED6[1U];          /**< Reserved for future use                            */
} MPAHBRAM_TypeDef;
/** @} End of group EFM32PG28_MPAHBRAM */

/**************************************************************************//**
 * @addtogroup EFM32PG28_MPAHBRAM
 * @{
 * @defgroup EFM32PG28_MPAHBRAM_BitFields MPAHBRAM Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for MPAHBRAM IPVERSION */
#define _MPAHBRAM_IPVERSION_RESETVALUE          0x00000002UL                            /**< Default value for MPAHBRAM_IPVERSION        */
#define _MPAHBRAM_IPVERSION_MASK                0x00000003UL                            /**< Mask for MPAHBRAM_IPVERSION                 */
#define _MPAHBRAM_IPVERSION_IPVERSION_SHIFT     0                                       /**< Shift value for MPAHBRAM_IPVERSION          */
#define _MPAHBRAM_IPVERSION_IPVERSION_MASK      0x3UL                                   /**< Bit mask for MPAHBRAM_IPVERSION             */
#define _MPAHBRAM_IPVERSION_IPVERSION_DEFAULT   0x00000002UL                            /**< Mode DEFAULT for MPAHBRAM_IPVERSION         */
#define MPAHBRAM_IPVERSION_IPVERSION_DEFAULT    (_MPAHBRAM_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for MPAHBRAM_IPVERSION */

/* Bit fields for MPAHBRAM CMD */
#define _MPAHBRAM_CMD_RESETVALUE                0x00000000UL                            /**< Default value for MPAHBRAM_CMD              */
#define _MPAHBRAM_CMD_MASK                      0x0000000FUL                            /**< Mask for MPAHBRAM_CMD                       */
#define MPAHBRAM_CMD_CLEARECCADDR0              (0x1UL << 0)                            /**< Clear ECCERRADDR0                           */
#define _MPAHBRAM_CMD_CLEARECCADDR0_SHIFT       0                                       /**< Shift value for MPAHBRAM_CLEARECCADDR0      */
#define _MPAHBRAM_CMD_CLEARECCADDR0_MASK        0x1UL                                   /**< Bit mask for MPAHBRAM_CLEARECCADDR0         */
#define _MPAHBRAM_CMD_CLEARECCADDR0_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CMD               */
#define MPAHBRAM_CMD_CLEARECCADDR0_DEFAULT      (_MPAHBRAM_CMD_CLEARECCADDR0_DEFAULT << 0) /**< Shifted mode DEFAULT for MPAHBRAM_CMD       */
#define MPAHBRAM_CMD_CLEARECCADDR1              (0x1UL << 1)                            /**< Clear ECCERRADDR1                           */
#define _MPAHBRAM_CMD_CLEARECCADDR1_SHIFT       1                                       /**< Shift value for MPAHBRAM_CLEARECCADDR1      */
#define _MPAHBRAM_CMD_CLEARECCADDR1_MASK        0x2UL                                   /**< Bit mask for MPAHBRAM_CLEARECCADDR1         */
#define _MPAHBRAM_CMD_CLEARECCADDR1_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CMD               */
#define MPAHBRAM_CMD_CLEARECCADDR1_DEFAULT      (_MPAHBRAM_CMD_CLEARECCADDR1_DEFAULT << 1) /**< Shifted mode DEFAULT for MPAHBRAM_CMD       */
#define MPAHBRAM_CMD_CLEARECCADDR2              (0x1UL << 2)                            /**< Clear ECCERRADDR2                           */
#define _MPAHBRAM_CMD_CLEARECCADDR2_SHIFT       2                                       /**< Shift value for MPAHBRAM_CLEARECCADDR2      */
#define _MPAHBRAM_CMD_CLEARECCADDR2_MASK        0x4UL                                   /**< Bit mask for MPAHBRAM_CLEARECCADDR2         */
#define _MPAHBRAM_CMD_CLEARECCADDR2_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CMD               */
#define MPAHBRAM_CMD_CLEARECCADDR2_DEFAULT      (_MPAHBRAM_CMD_CLEARECCADDR2_DEFAULT << 2) /**< Shifted mode DEFAULT for MPAHBRAM_CMD       */
#define MPAHBRAM_CMD_CLEARECCADDR3              (0x1UL << 3)                            /**< Clear ECCERRADDR3                           */
#define _MPAHBRAM_CMD_CLEARECCADDR3_SHIFT       3                                       /**< Shift value for MPAHBRAM_CLEARECCADDR3      */
#define _MPAHBRAM_CMD_CLEARECCADDR3_MASK        0x8UL                                   /**< Bit mask for MPAHBRAM_CLEARECCADDR3         */
#define _MPAHBRAM_CMD_CLEARECCADDR3_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CMD               */
#define MPAHBRAM_CMD_CLEARECCADDR3_DEFAULT      (_MPAHBRAM_CMD_CLEARECCADDR3_DEFAULT << 3) /**< Shifted mode DEFAULT for MPAHBRAM_CMD       */

/* Bit fields for MPAHBRAM CTRL */
#define _MPAHBRAM_CTRL_RESETVALUE               0x00000040UL                            /**< Default value for MPAHBRAM_CTRL             */
#define _MPAHBRAM_CTRL_MASK                     0x0000007FUL                            /**< Mask for MPAHBRAM_CTRL                      */
#define MPAHBRAM_CTRL_ECCEN                     (0x1UL << 0)                            /**< Enable ECC functionality                    */
#define _MPAHBRAM_CTRL_ECCEN_SHIFT              0                                       /**< Shift value for MPAHBRAM_ECCEN              */
#define _MPAHBRAM_CTRL_ECCEN_MASK               0x1UL                                   /**< Bit mask for MPAHBRAM_ECCEN                 */
#define _MPAHBRAM_CTRL_ECCEN_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CTRL              */
#define MPAHBRAM_CTRL_ECCEN_DEFAULT             (_MPAHBRAM_CTRL_ECCEN_DEFAULT << 0)     /**< Shifted mode DEFAULT for MPAHBRAM_CTRL      */
#define MPAHBRAM_CTRL_ECCWEN                    (0x1UL << 1)                            /**< Enable ECC syndrome writes                  */
#define _MPAHBRAM_CTRL_ECCWEN_SHIFT             1                                       /**< Shift value for MPAHBRAM_ECCWEN             */
#define _MPAHBRAM_CTRL_ECCWEN_MASK              0x2UL                                   /**< Bit mask for MPAHBRAM_ECCWEN                */
#define _MPAHBRAM_CTRL_ECCWEN_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CTRL              */
#define MPAHBRAM_CTRL_ECCWEN_DEFAULT            (_MPAHBRAM_CTRL_ECCWEN_DEFAULT << 1)    /**< Shifted mode DEFAULT for MPAHBRAM_CTRL      */
#define MPAHBRAM_CTRL_ECCERRFAULTEN             (0x1UL << 2)                            /**< ECC Error bus fault enable                  */
#define _MPAHBRAM_CTRL_ECCERRFAULTEN_SHIFT      2                                       /**< Shift value for MPAHBRAM_ECCERRFAULTEN      */
#define _MPAHBRAM_CTRL_ECCERRFAULTEN_MASK       0x4UL                                   /**< Bit mask for MPAHBRAM_ECCERRFAULTEN         */
#define _MPAHBRAM_CTRL_ECCERRFAULTEN_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CTRL              */
#define MPAHBRAM_CTRL_ECCERRFAULTEN_DEFAULT     (_MPAHBRAM_CTRL_ECCERRFAULTEN_DEFAULT << 2) /**< Shifted mode DEFAULT for MPAHBRAM_CTRL      */
#define _MPAHBRAM_CTRL_AHBPORTPRIORITY_SHIFT    3                                       /**< Shift value for MPAHBRAM_AHBPORTPRIORITY    */
#define _MPAHBRAM_CTRL_AHBPORTPRIORITY_MASK     0x38UL                                  /**< Bit mask for MPAHBRAM_AHBPORTPRIORITY       */
#define _MPAHBRAM_CTRL_AHBPORTPRIORITY_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CTRL              */
#define _MPAHBRAM_CTRL_AHBPORTPRIORITY_NONE     0x00000000UL                            /**< Mode NONE for MPAHBRAM_CTRL                 */
#define _MPAHBRAM_CTRL_AHBPORTPRIORITY_PORT0    0x00000001UL                            /**< Mode PORT0 for MPAHBRAM_CTRL                */
#define _MPAHBRAM_CTRL_AHBPORTPRIORITY_PORT1    0x00000002UL                            /**< Mode PORT1 for MPAHBRAM_CTRL                */
#define _MPAHBRAM_CTRL_AHBPORTPRIORITY_PORT2    0x00000003UL                            /**< Mode PORT2 for MPAHBRAM_CTRL                */
#define _MPAHBRAM_CTRL_AHBPORTPRIORITY_PORT3    0x00000004UL                            /**< Mode PORT3 for MPAHBRAM_CTRL                */
#define MPAHBRAM_CTRL_AHBPORTPRIORITY_DEFAULT   (_MPAHBRAM_CTRL_AHBPORTPRIORITY_DEFAULT << 3) /**< Shifted mode DEFAULT for MPAHBRAM_CTRL      */
#define MPAHBRAM_CTRL_AHBPORTPRIORITY_NONE      (_MPAHBRAM_CTRL_AHBPORTPRIORITY_NONE << 3) /**< Shifted mode NONE for MPAHBRAM_CTRL         */
#define MPAHBRAM_CTRL_AHBPORTPRIORITY_PORT0     (_MPAHBRAM_CTRL_AHBPORTPRIORITY_PORT0 << 3) /**< Shifted mode PORT0 for MPAHBRAM_CTRL        */
#define MPAHBRAM_CTRL_AHBPORTPRIORITY_PORT1     (_MPAHBRAM_CTRL_AHBPORTPRIORITY_PORT1 << 3) /**< Shifted mode PORT1 for MPAHBRAM_CTRL        */
#define MPAHBRAM_CTRL_AHBPORTPRIORITY_PORT2     (_MPAHBRAM_CTRL_AHBPORTPRIORITY_PORT2 << 3) /**< Shifted mode PORT2 for MPAHBRAM_CTRL        */
#define MPAHBRAM_CTRL_AHBPORTPRIORITY_PORT3     (_MPAHBRAM_CTRL_AHBPORTPRIORITY_PORT3 << 3) /**< Shifted mode PORT3 for MPAHBRAM_CTRL        */
#define MPAHBRAM_CTRL_ADDRFAULTEN               (0x1UL << 6)                            /**< Address fault bus fault enable              */
#define _MPAHBRAM_CTRL_ADDRFAULTEN_SHIFT        6                                       /**< Shift value for MPAHBRAM_ADDRFAULTEN        */
#define _MPAHBRAM_CTRL_ADDRFAULTEN_MASK         0x40UL                                  /**< Bit mask for MPAHBRAM_ADDRFAULTEN           */
#define _MPAHBRAM_CTRL_ADDRFAULTEN_DEFAULT      0x00000001UL                            /**< Mode DEFAULT for MPAHBRAM_CTRL              */
#define MPAHBRAM_CTRL_ADDRFAULTEN_DEFAULT       (_MPAHBRAM_CTRL_ADDRFAULTEN_DEFAULT << 6) /**< Shifted mode DEFAULT for MPAHBRAM_CTRL      */

/* Bit fields for MPAHBRAM ECCERRADDR0 */
#define _MPAHBRAM_ECCERRADDR0_RESETVALUE        0x00000000UL                            /**< Default value for MPAHBRAM_ECCERRADDR0      */
#define _MPAHBRAM_ECCERRADDR0_MASK              0xFFFFFFFFUL                            /**< Mask for MPAHBRAM_ECCERRADDR0               */
#define _MPAHBRAM_ECCERRADDR0_ADDR_SHIFT        0                                       /**< Shift value for MPAHBRAM_ADDR               */
#define _MPAHBRAM_ECCERRADDR0_ADDR_MASK         0xFFFFFFFFUL                            /**< Bit mask for MPAHBRAM_ADDR                  */
#define _MPAHBRAM_ECCERRADDR0_ADDR_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_ECCERRADDR0       */
#define MPAHBRAM_ECCERRADDR0_ADDR_DEFAULT       (_MPAHBRAM_ECCERRADDR0_ADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for MPAHBRAM_ECCERRADDR0*/

/* Bit fields for MPAHBRAM ECCERRADDR1 */
#define _MPAHBRAM_ECCERRADDR1_RESETVALUE        0x00000000UL                            /**< Default value for MPAHBRAM_ECCERRADDR1      */
#define _MPAHBRAM_ECCERRADDR1_MASK              0xFFFFFFFFUL                            /**< Mask for MPAHBRAM_ECCERRADDR1               */
#define _MPAHBRAM_ECCERRADDR1_ADDR_SHIFT        0                                       /**< Shift value for MPAHBRAM_ADDR               */
#define _MPAHBRAM_ECCERRADDR1_ADDR_MASK         0xFFFFFFFFUL                            /**< Bit mask for MPAHBRAM_ADDR                  */
#define _MPAHBRAM_ECCERRADDR1_ADDR_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_ECCERRADDR1       */
#define MPAHBRAM_ECCERRADDR1_ADDR_DEFAULT       (_MPAHBRAM_ECCERRADDR1_ADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for MPAHBRAM_ECCERRADDR1*/

/* Bit fields for MPAHBRAM ECCERRADDR2 */
#define _MPAHBRAM_ECCERRADDR2_RESETVALUE        0x00000000UL                            /**< Default value for MPAHBRAM_ECCERRADDR2      */
#define _MPAHBRAM_ECCERRADDR2_MASK              0xFFFFFFFFUL                            /**< Mask for MPAHBRAM_ECCERRADDR2               */
#define _MPAHBRAM_ECCERRADDR2_ADDR_SHIFT        0                                       /**< Shift value for MPAHBRAM_ADDR               */
#define _MPAHBRAM_ECCERRADDR2_ADDR_MASK         0xFFFFFFFFUL                            /**< Bit mask for MPAHBRAM_ADDR                  */
#define _MPAHBRAM_ECCERRADDR2_ADDR_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_ECCERRADDR2       */
#define MPAHBRAM_ECCERRADDR2_ADDR_DEFAULT       (_MPAHBRAM_ECCERRADDR2_ADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for MPAHBRAM_ECCERRADDR2*/

