SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_mpahbram.h
/* Bit fields for MPAHBRAM IEN */
#define _MPAHBRAM_IEN_RESETVALUE                0x00000000UL                            /**< Default value for MPAHBRAM_IEN              */
#define _MPAHBRAM_IEN_MASK                      0x000000FFUL                            /**< Mask for MPAHBRAM_IEN                       */
#define MPAHBRAM_IEN_AHB0ERR1B                  (0x1UL << 0)                            /**< AHB0 1-bit ECC Error Interrupt Enable       */
#define _MPAHBRAM_IEN_AHB0ERR1B_SHIFT           0                                       /**< Shift value for MPAHBRAM_AHB0ERR1B          */
#define _MPAHBRAM_IEN_AHB0ERR1B_MASK            0x1UL                                   /**< Bit mask for MPAHBRAM_AHB0ERR1B             */
#define _MPAHBRAM_IEN_AHB0ERR1B_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_IEN               */
#define MPAHBRAM_IEN_AHB0ERR1B_DEFAULT          (_MPAHBRAM_IEN_AHB0ERR1B_DEFAULT << 0)  /**< Shifted mode DEFAULT for MPAHBRAM_IEN       */
#define MPAHBRAM_IEN_AHB1ERR1B                  (0x1UL << 1)                            /**< AHB1 1-bit ECC Error Interrupt Enable       */
#define _MPAHBRAM_IEN_AHB1ERR1B_SHIFT           1                                       /**< Shift value for MPAHBRAM_AHB1ERR1B          */
#define _MPAHBRAM_IEN_AHB1ERR1B_MASK            0x2UL                                   /**< Bit mask for MPAHBRAM_AHB1ERR1B             */
#define _MPAHBRAM_IEN_AHB1ERR1B_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_IEN               */
#define MPAHBRAM_IEN_AHB1ERR1B_DEFAULT          (_MPAHBRAM_IEN_AHB1ERR1B_DEFAULT << 1)  /**< Shifted mode DEFAULT for MPAHBRAM_IEN       */
#define MPAHBRAM_IEN_AHB2ERR1B                  (0x1UL << 2)                            /**< AHB2 1-bit ECC Error Interrupt Enable       */
#define _MPAHBRAM_IEN_AHB2ERR1B_SHIFT           2                                       /**< Shift value for MPAHBRAM_AHB2ERR1B          */
#define _MPAHBRAM_IEN_AHB2ERR1B_MASK            0x4UL                                   /**< Bit mask for MPAHBRAM_AHB2ERR1B             */
#define _MPAHBRAM_IEN_AHB2ERR1B_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_IEN               */
#define MPAHBRAM_IEN_AHB2ERR1B_DEFAULT          (_MPAHBRAM_IEN_AHB2ERR1B_DEFAULT << 2)  /**< Shifted mode DEFAULT for MPAHBRAM_IEN       */
#define MPAHBRAM_IEN_AHB3ERR1B                  (0x1UL << 3)                            /**< AHB3 1-bit ECC Error Interrupt Enable       */
#define _MPAHBRAM_IEN_AHB3ERR1B_SHIFT           3                                       /**< Shift value for MPAHBRAM_AHB3ERR1B          */
#define _MPAHBRAM_IEN_AHB3ERR1B_MASK            0x8UL                                   /**< Bit mask for MPAHBRAM_AHB3ERR1B             */
#define _MPAHBRAM_IEN_AHB3ERR1B_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_IEN               */
#define MPAHBRAM_IEN_AHB3ERR1B_DEFAULT          (_MPAHBRAM_IEN_AHB3ERR1B_DEFAULT << 3)  /**< Shifted mode DEFAULT for MPAHBRAM_IEN       */
#define MPAHBRAM_IEN_AHB0ERR2B                  (0x1UL << 4)                            /**< AHB0 2-bit ECC Error Interrupt Enable       */
#define _MPAHBRAM_IEN_AHB0ERR2B_SHIFT           4                                       /**< Shift value for MPAHBRAM_AHB0ERR2B          */
#define _MPAHBRAM_IEN_AHB0ERR2B_MASK            0x10UL                                  /**< Bit mask for MPAHBRAM_AHB0ERR2B             */
#define _MPAHBRAM_IEN_AHB0ERR2B_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_IEN               */
#define MPAHBRAM_IEN_AHB0ERR2B_DEFAULT          (_MPAHBRAM_IEN_AHB0ERR2B_DEFAULT << 4)  /**< Shifted mode DEFAULT for MPAHBRAM_IEN       */
#define MPAHBRAM_IEN_AHB1ERR2B                  (0x1UL << 5)                            /**< AHB1 2-bit ECC Error Interrupt Enable       */
#define _MPAHBRAM_IEN_AHB1ERR2B_SHIFT           5                                       /**< Shift value for MPAHBRAM_AHB1ERR2B          */
#define _MPAHBRAM_IEN_AHB1ERR2B_MASK            0x20UL                                  /**< Bit mask for MPAHBRAM_AHB1ERR2B             */
#define _MPAHBRAM_IEN_AHB1ERR2B_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_IEN               */
#define MPAHBRAM_IEN_AHB1ERR2B_DEFAULT          (_MPAHBRAM_IEN_AHB1ERR2B_DEFAULT << 5)  /**< Shifted mode DEFAULT for MPAHBRAM_IEN       */
#define MPAHBRAM_IEN_AHB2ERR2B                  (0x1UL << 6)                            /**< AHB2 2-bit ECC Error Interrupt Enable       */
#define _MPAHBRAM_IEN_AHB2ERR2B_SHIFT           6                                       /**< Shift value for MPAHBRAM_AHB2ERR2B          */
#define _MPAHBRAM_IEN_AHB2ERR2B_MASK            0x40UL                                  /**< Bit mask for MPAHBRAM_AHB2ERR2B             */
#define _MPAHBRAM_IEN_AHB2ERR2B_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_IEN               */
#define MPAHBRAM_IEN_AHB2ERR2B_DEFAULT          (_MPAHBRAM_IEN_AHB2ERR2B_DEFAULT << 6)  /**< Shifted mode DEFAULT for MPAHBRAM_IEN       */
#define MPAHBRAM_IEN_AHB3ERR2B                  (0x1UL << 7)                            /**< AHB3 2-bit ECC Error Interrupt Enable       */
#define _MPAHBRAM_IEN_AHB3ERR2B_SHIFT           7                                       /**< Shift value for MPAHBRAM_AHB3ERR2B          */
#define _MPAHBRAM_IEN_AHB3ERR2B_MASK            0x80UL                                  /**< Bit mask for MPAHBRAM_AHB3ERR2B             */
#define _MPAHBRAM_IEN_AHB3ERR2B_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_IEN               */
#define MPAHBRAM_IEN_AHB3ERR2B_DEFAULT          (_MPAHBRAM_IEN_AHB3ERR2B_DEFAULT << 7)  /**< Shifted mode DEFAULT for MPAHBRAM_IEN       */

/* Bit fields for MPAHBRAM RAMBANKSVALID */
#define _MPAHBRAM_RAMBANKSVALID_RESETVALUE      0xFFFFFFFFUL                            /**< Default value for MPAHBRAM_RAMBANKSVALID    */
#define _MPAHBRAM_RAMBANKSVALID_MASK            0x0000FFFFUL                            /**< Mask for MPAHBRAM_RAMBANKSVALID             */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_SHIFT 0                                       /**< Shift value for MPAHBRAM_RAMBANKSVALID      */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_MASK 0xFFFFUL                                /**< Bit mask for MPAHBRAM_RAMBANKSVALID         */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_DEFAULT 0xFFFFFFFFUL                            /**< Mode DEFAULT for MPAHBRAM_RAMBANKSVALID     */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0 0x00000001UL                            /**< Mode BLK0 for MPAHBRAM_RAMBANKSVALID        */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO1 0x00000003UL                            /**< Mode BLK0TO1 for MPAHBRAM_RAMBANKSVALID     */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO2 0x00000007UL                            /**< Mode BLK0TO2 for MPAHBRAM_RAMBANKSVALID     */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO3 0x0000000FUL                            /**< Mode BLK0TO3 for MPAHBRAM_RAMBANKSVALID     */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO4 0x0000001FUL                            /**< Mode BLK0TO4 for MPAHBRAM_RAMBANKSVALID     */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO5 0x0000003FUL                            /**< Mode BLK0TO5 for MPAHBRAM_RAMBANKSVALID     */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO6 0x0000007FUL                            /**< Mode BLK0TO6 for MPAHBRAM_RAMBANKSVALID     */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO7 0x000000FFUL                            /**< Mode BLK0TO7 for MPAHBRAM_RAMBANKSVALID     */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO8 0x000001FFUL                            /**< Mode BLK0TO8 for MPAHBRAM_RAMBANKSVALID     */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO9 0x000003FFUL                            /**< Mode BLK0TO9 for MPAHBRAM_RAMBANKSVALID     */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO10 0x000007FFUL                            /**< Mode BLK0TO10 for MPAHBRAM_RAMBANKSVALID    */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO11 0x00000FFFUL                            /**< Mode BLK0TO11 for MPAHBRAM_RAMBANKSVALID    */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO12 0x00001FFFUL                            /**< Mode BLK0TO12 for MPAHBRAM_RAMBANKSVALID    */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO13 0x00003FFFUL                            /**< Mode BLK0TO13 for MPAHBRAM_RAMBANKSVALID    */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO14 0x00007FFFUL                            /**< Mode BLK0TO14 for MPAHBRAM_RAMBANKSVALID    */
#define _MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO15 0x0000FFFFUL                            /**< Mode BLK0TO15 for MPAHBRAM_RAMBANKSVALID    */
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_DEFAULT (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_DEFAULT << 0) /**< Shifted mode DEFAULT for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0 << 0) /**< Shifted mode BLK0 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO1 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO1 << 0) /**< Shifted mode BLK0TO1 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO2 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO2 << 0) /**< Shifted mode BLK0TO2 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO3 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO3 << 0) /**< Shifted mode BLK0TO3 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO4 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO4 << 0) /**< Shifted mode BLK0TO4 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO5 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO5 << 0) /**< Shifted mode BLK0TO5 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO6 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO6 << 0) /**< Shifted mode BLK0TO6 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO7 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO7 << 0) /**< Shifted mode BLK0TO7 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO8 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO8 << 0) /**< Shifted mode BLK0TO8 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO9 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO9 << 0) /**< Shifted mode BLK0TO9 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO10 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO10 << 0) /**< Shifted mode BLK0TO10 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO11 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO11 << 0) /**< Shifted mode BLK0TO11 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO12 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO12 << 0) /**< Shifted mode BLK0TO12 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO13 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO13 << 0) /**< Shifted mode BLK0TO13 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO14 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO14 << 0) /**< Shifted mode BLK0TO14 for MPAHBRAM_RAMBANKSVALID*/
#define MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO15 (_MPAHBRAM_RAMBANKSVALID_RAMBANKSVALID_BLK0TO15 << 0) /**< Shifted mode BLK0TO15 for MPAHBRAM_RAMBANKSVALID*/

